Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Gewebe aus Keramikfasern für Isolierzwecke
en: Fabrics made from ceramic fibres for use as insulation

source: Dichtungsmittel zum Stoppen von Leckagen in Öltanks [ausgenommen Chemikalien]
en: Sealing compounds for stopping leakage from oil tanks [other than chemicals]

source: Vorisolierte verbundene flexible Schläuche, nicht aus Metall
en: Pre-insulated bonded flexible hoses (Non-metallic -)

source: Vorisolierte verbundene flexible Schläuche für Fahrzeugmotoren, nicht aus Metall
en: Pre-insulated bonded flexible hoses (Non-metallic -) for use in vehicle engines

source: Dichtungen für Fugen, nicht aus Metall
en: Seals (Non-metallic -) for joints

source: Dichtungen für Stoßdämpfer, nicht aus Metall
en: Seals (Non-metallic -) for shock absorbers

source: Dichtungen, nicht aus Metall, zur Reibungsminderung an Metallen
en: Seals (Non-metallic -) for the reduction of friction in metals

source: Gummischläuche zum Spleißen von Kabeln
en: Rubber hose for the splicing of cables

source: Gummi in Form von Folien zur Verwendung in der Produktion
en: Rubber in the form of sheeting for use in manufacture

source: Waren aus Gummi für Dichtungszwecke
en: Articles made of rubber for jointing purposes

source: Unterlegscheiben aus Vulkanfiber zum Schutz von Haken
en: Washers of vulcanised fibre for the protection of hooks

source: Folien aus Kunststoffen [Halbfabrikate]
en: Foils of plastics [semi-finished products]

source: Dichtungen in Form von Scheiben
en: Gaskets in the form of sheets

source: Streifen aus Gummi zum Schutz der Ecken von Möbeln
en: Strips of rubber for protecting the edges of furniture

source: Klebebänder für elektrische Isolierzwecke
en: Tapes (Adhesive -) for electrical insulating purposes

source: Harze zum Spleißen von Kabeln
en: Resins for use in cable splicing

source: Rohrabzweigungsstücke, nicht aus Metall
en: Pipe fittings [junctions] (non-metallic -)

source: Schalldämmungsmittel für Gebäude
en: Soundproofing materials for buildings

source: Vulkanfiber für die Herstellung von Bauisoliermaterial
en: Vulcanized fiber for use in the manufacture of building insulation

source: Vulkanfiber für die Herstellung von elektrischem Isoliermaterial
en: Vulcanized fiber for use in the manufacture of electrical insulation

source: Kitt
en: Lute

source: Polystyrol [Halbfabrikate]
en: Polystyrene [semi finished]

source: Polyäthylenfolie zur Isolierung
en: Polythene sheeting for insulation

source: Polyurethanschaum [Halbfabrikate]
en: Polyurethane foam [semi-finished]

source: Glasfaserisoliermaterial für Bauzwecke
en: Glass fiber insulation for use in construction

source: Glaswolle zur Bauisolierung
en: Glass wool for building insulation

source: Schläuche, nicht aus Metall
en: Flexible hoses, not of metal

source: Waren aus Gummi zum Abdichten
en: Articles made of rubber for sealing

source: Zugluftdichtungen für Fenster
en: Draught preventers for windows

source: Wärmeisolierte Schläuche aus Kunststoff
en: Thermally insulated pipes made of plastic

source: Isolierungen für Bauzwecke
en: Insulation for building purposes

source: Gummiaufhängungen für Motoren
en: Mountings made of rubber for engines

source: Nicht metallische Rohrfittings
en: Non-metallic couplings for tubes

source: Industrielacke zur Isolierung von Gebäuden
en: Industrial coatings for insulating buildings

source: Isoliermaterial zur Verwendung in der Schiffsbauindustrie
en: Insulation material for use in the ship building industry

source: Schwimmsperren gegen Umweltverschmutzung
en: Floating anti-pollution barriers

source: Hydrochloriertes Gummi
en: Hydrochlorinated rubber

source: Flexible Baumwollschläuche mit Drahtgeflecht
en: Flexible hose of cotton with wire braiding

source: Flexible Schläuche aus kunstfaserverstärktem Gummi
en: Flexible hoses of rubber reinforced with synthetic fabric

source: Isoliermaterial für Kabel
en: Insulators for cables

source: Geformte Streifen aus Gummi als Zugluftabdichtung an Fenstern
en: Shaped strips of rubber for use as draught seals in windows

source: Klebebänder für die Sicherung von Teppichen
en: Adhesive tapes for use in securing carpets

source: Platten aus Vinyl [Halbfabrikate]
en: Panels made of vinyl [semi-worked]

source: Rohrkupplungen, nicht aus Metall [Teile von starren Wasserrohren]
en: Pipe connections (non-metallic -) [parts of rigid water pipes]

source: Webstoffe aus Keramikfasern für Isolierzwecke
en: Fabrics woven from ceramic fibres for use as insulation

source: Durchsichtige Acrylharzplatten mit leitfähigem Drahtgeflecht
en: Transparent acrylic resin sheets incorporating conductive meshes

source: Behandeltes Kautschukpulver als Rohmaterial
en: Treated rubber powder as raw material

source: Wasserdichte Manschetten aus Vulkanfiber
en: Water-tight collars of vulcanised fibre

source: Radialwellendichtungen, nicht aus Metall
en: Rotary shaft (Seals for -) non-metallic-

source: Kunstharze und synthetische Harze [Halbfabrikate]
en: Synthetic resins [semi-finished products]

source: Schutzhüllen für Steuerleitungen aus synthetischem Gummi
en: Control line protectors made from synthetic rubber

source: Vernetzte Polymermembranen in Bogenform
en: Cross-linked polymeric membranes in sheet form

source: Elastomere zum Bekleben von Flächen beim Sandstrahlen
en: Elastomers for bonding to surfaces in areas for shot-blasting

source: Eckverbindungsstücke für Schläuche, nicht aus Metall
en: Elbow joints (Non-metallic -) for flexible pipes

source: Elektrisches Isoliermaterial aus Glimmerpartikeln in biegsamem Glas
en: Electrical insulating material of mica particles in pliant glass

source: Schaumgummi mit geschlossenen Zellen zur Schwingungsdämpfung
en: Expanded closed cell rubber for vibration deadening

source: Isoliermaterial für Klimaanlagen
en: Insulation for air conditioners

source: Mineralwolle als Isoliermaterial für Gebäude
en: Mineral wool for use as a building insulator

source: Füllmaterial aus Kunststoff
en: Stuffing materials of plastics

source: Substrate für die Elektroisolation
en: Substrates for electrical insulation

source: Packungsmaterial aus Gummi für Versandbehälter
en: Foam sheeting for use as a building insulation

source: Schläuche aus synthetischem Kautschuk
en: Rubber packing for shipping containers

source: Unterlegscheiben aus Gummi oder Vulkanfiber
en: Washers of rubber or vulcanized fiber [fibre]

source: Mikroporöse synthetische Folien für die Herstellung von Arbeitsschutzbekleidung
en: Microporous synthetic sheets for the manufacture of protective workwear

source: Kunststoffmaterial in Form von Chips als Packungsmaterial
en: Plastic materials in the form of chips for use as packing

source: Kunststoffmaterial in Form von Formstücken als Polstermaterial in Verpackungen
en: Plastic materials in the form of mouldings for use as cushioning materials in packaging

source: Isolierfirnisse auf der Basis von Kunststoffen
en: Insulating varnishes based on plastics materials

source: Schlauchleitungen aus Kunststoff
en: Hose pipes made of plastic

source: Schläuche für Fahrzeugkühler, nicht aus Metall
en: Hoses (Non-metallic -) for vehicle radiators

source: Flexible Kunststofffolien, ausgenommen für Verpackungszwecke
en: Flexible plastic films, other than for packaging

source: Gummiummantelungen für Schläuche
en: Casings of rubber for tubes

source: Schläuche für gewerbliche Zwecke, nicht aus Metall
en: Hoses (Non-metallic -) for industrial purposes

source: Dehnungsfugen für die Errichtung von Wänden
en: Expansion joints for use in wall constructions

source: Isoliermaterial für Bauzwecke
en: Insulating materials for building

source: Isoliermaterial für die Wärmedämmung
en: Insulating materials for insulation against heat

source: Isolieranstrichfarben für Fassaden
en: Insulating paints for facades

source: Schallabsorbierende Deckenverkleidungen
en: Sound-adsorbing ceiling coverings

source: Gesponnene Polyesterfasern [ausgenommen für Textilzwecke]
en: Spun polyester fibre [other than for textile use]

source: Gummifäden, nicht für Textilzwecke
en: Threads of rubber, not for use in textiles

source: Synthetische Reparaturharze
en: Repair resins (Synthetic -)

source: Dichtungen aus Vulkanfiber
en: Grommets made of vulcanized fibre

source: Weiche Hochglanzpolyvinylchloridfolien zur Verwendung in der Produktion
en: High gloss, soft polyvinylchloride films for use in manufacture

source: Schallschutzstreifen [Gummi]
en: Noise suppression strips [rubber]

source: Dichtungsprofile, nicht aus Metall
en: Sealing profiles (Non-metallic -)

source: Dichtungsstreifen aus synthetischem Kautschuk
en: Sealing strips made of synthetic rubber

source: Radialwellendichtringe, nicht aus Metall
en: Radial shaft sealing rings (Non-metallic -)

source: Poröse Polymermembrane in Bogenform
en: Polymeric porous membranes in sheet form

source: Sequenzierungsmembranen aus Zellulosederivaten
en: Sequency membranes of cellulose derivatives

source: Verpackungsklebebänder, ausgenommen für Papier- und Schreibwaren oder für Haushaltszwecke
en: Packaging tapes (Adhesive -), other than for household or stationery use

source: Rohrdichtungsmittel zur Abdichtung von Rohrgewinden
en: Pipe jointing compounds for sealing pipe threads

source: Stützende Rohrhüllen aus Gummi
en: Pipe support sleeves [rubber]

source: Kunstharzverbindungen [teilweise bearbeitet] für industrielle Zwecke
en: Synthetic resin compositions [semi-processed] for industrial purposes

source: Silikonschaum zur Wärmedämmung
en: Silicone foam thermal insulation

source: Vliese aus Kohlenstoffrohfasern [für Isolierzwecke]
en: Fleeces of crude fibres of carbon [insulation]

source: Metallfolien mit Papierbeschichtung [mit überwiegendem Papieranteil] für Isolierzwecke
en: Metal foils laminated with paper [paper predominating] for insulation

source: Gewebe aus Seide für Isolierzwecke
en: Fabrics made from silk for use as insulation

source: Schallschirme zur Isolierung
en: Acoustic screens for insulation

source: Teilweise bearbeiteter Acryllatex
en: Acrylic latexes (Semi-processed -)

source: Abdichtungsmittel für Fugen für Bauzwecke
en: Sealants for joints for building purposes

source: Dichtungsmittel zur Verwendung im Bauwesen
en: Sealing agents for use in the construction industry

source: Dichtungen zur Vorbeugung von Gasaustritten, nicht aus Metall
en: Seals (Non-metallic -) for preventing leakage of gases

source: Gummi für die Wärmeisolierung
en: Rubber for heat insulation

source: Viskosefolien, außer für Verpackungszwecke
en: Viscose sheets, other than for wrapping

source: Dichtungen aus synthetischem Gummi
en: Grommets made of synthetic rubber

source: Unterlegscheiben aus Vulkanfiber zum Schutz von Schrauben
en: Washers of vulcanised fibre for the protection of screws

source: Dichtungen für Kraftfahrzeuge
en: Gaskets for automotive use

source: Synthetisches Gummi in Form von Platten
en: Synthetic rubber in the form of sheets

source: Harze zur Regulierung der Strömungseigenschaften von Flüssigkeiten
en: Resins for use in controlling the flow properties of fluids

source: Kunststofffolien, außer für Verpackungszwecke
en: Plastic film, other than for wrapping

source: Teilweise bearbeitetes Zelluloseazetat
en: Cellulose acetate, semi-processed

source: Schalldämmende Fußbodenbelagunterlagen
en: Sound control flooring underlayment

source: Thermisch gebundene Baumwollwattierung als Lärmschutz
en: Thermally bonded cotton batting used as a sound deadening material

source: Schaum zur Schalldämpfung
en: Foam for use in sound absorption

source: Schaumstoff zur Schalldämmung
en: Foam for use in sound insulation

source: Schaumglas zur Verwendung als Isoliermaterial
en: Foam glass for use as an insulating materials

source: Lacke für elektrische Isolierzwecke zum Aufbringen auf elektronische Bauteile
en: Varnishes for electrical insulation for application to electronic components

source: Unterlegscheiben aus Gummi für den Schutz von Schrauben
en: Washers of rubber for the protection of screws

source: Unterlegscheiben aus Gummi für den Schutz von Zugbolzen
en: Washers of rubber for the protection of draw bolts

source: Unterlegscheiben aus Gummi für den Schutz von Ankerschrauben
en: Washers of rubber for the protection of lag screws

source: Graphitpackungen für Dichtungen
en: Graphite packing for gaskets

source: Isoliermanschetten für Elektroleitungen
en: Insulating sleeves for power lines

source: Elastomere Polymere
en: Elastomer polymers

source: Wärmeisoliermaterial für den Umbau von Dachstühlen
en: Thermal insulation material used in the conversion of lofts

source: Transfermembranen aus Zellulosederivaten
en: Transfer membranes of cellulose derivatives

source: Transfermembranen aus Polyamiden
en: Transfer membranes of polyamides

source: Klebebänder für technische Zwecke
en: Adhesive tapes, for technical purposes

source: Zelluloseazetatfolien für die Herstellung von druckempfindlichem Klebeband
en: Cellulose acetate film used in the manufacture of pressure sensitive adhesive tape

source: Gummiformen für die Herstellung von dekorativen Pflastersteinen
en: Moulds of rubber for use in the production of decorative paving stones

source: Isolatoren für elektronische Zwecke
en: Insulators for electronic use

source: Isolierbeschichtungsmittel aus Kunstharz
en: Insulatory coatings of plastic resin

source: Elektrisch isolierende Bänder
en: Electrical insulating tape

source: Flexible Baumwollschläuche mit Drahteinsätzen
en: Flexible hose of cotton with wire inserts

source: Flexible Schlauchleitungen aus Gummi
en: Flexible hose pipes of rubber

source: Gummistopfen zur Verwendung in der Produktion
en: Plugs of rubber for use in manufacture

source: Geformte Streifen aus Gummi für die Herstellung von Türen
en: Shaped strips of rubber for use in the manufacture of doors

source: Nachleuchtende Farben [Isoliermaterial]
en: Photo-luminescent paints [insulating]

source: Wärmeisolierhüllen für Warmwasserzylinder
en: Thermal insulation jackets for hot water cylinders

source: Gewebe aus organischen Fasern für Isolierzwecke
en: Fabrics of organic fibres for use as insulation

source: Wasserdichte Membrane aus Vulkanfiber
en: Waterproof membranes of vulcanised fibre

source: Gummiabdeckungen für Schalter
en: Rubber covers for switches

source: Geschäumte synthetische Harze [teilweise bearbeitet]
en: Expanded synthetic resins [semi-processed]

source: Latexgummi zur Verwendung in der Produktion
en: Latex rubber for use in manufacture

source: Formbare Massen zur Verwendung beim Abdichten und Verpacken
en: Moldable compounds for use in jointing and packing

source: Synthetisches Polstermaterial für Filtrationszwecke in Filtern
en: Synthetic padding to be used for filtration in filters

source: Wasserdichte Ringe für Rohrleitungen
en: Watertight rings for plumbing pipes

source: Abschirmdichtungen gegen elektromagnetische Störungen
en: Electromagnetic interference shielding gaskets

source: Gummidichtungsmittel für Versiegelungs- und Klebezwecke
en: Rubber sealant for caulking and adhesive purposes

source: Flexible Schläuche aus textilem Material
en: Non-metallic flexible hoses of textile

source: Isolierte Erdrohre, nicht aus Metall
en: Non-metallic underground tubing

source: Akrylharzplatten für die Herstellung von Verbundglas
en: Acrylic resin sheeting for use in the manufacture of laminated glass

source: Beschichtetes Kunststoffmaterial zur Verwendung mit mechanischen Gravierwerkzeugen
en: Laminated plastics material for use with mechanical engraving material

source: Chloriertes Gummi
en: Chlorinated rubber

source: Schläuche für Wasserfahrzeuge, nicht aus Metall
en: Hoses (Non-metallic -) for use with watercraft

source: Kohlefaserverstärkte Kunstharze zur Verwendung in der Produktion
en: Carbon fibre reinforced synthetic resins for use in manufacture

source: Teppichklebeband [ausgenommen für Haushaltszwecke]
en: Carpet tape [other than for household use]

source: Folien aus regenerierter Zellulose [außer für Verpackungszwecke]
en: Foil of regenerated cellulose, other than for wrapping

source: Faserplatten zur Isolierung
en: Fibre board for use as insulation

source: Fasern für Isolierungszwecke
en: Fibres for insulating purposes

source: Extrudierte Polyethylenfolien zum Bau von Gewächshäusern
en: Extruded polythene sheeting for the construction of greenhouses

source: Isoliermaterial aus wiederverarbeiteten Kunststoffen
en: Insulating materials made from reprocessed plastics

source: Distanzstücke aus Gummi
en: Spacer brackets (Rubber -)

source: Abstandshalter aus Vulkanfiber für Glasfaserkabel
en: Spacers (Vulcanised fibre -) for use with optical cables

source: Ventile aus Gummi oder Vulkanfiber [ausgenommen Maschinenteile]
en: Valves of rubber or vulcanized fiber [not including machine elements]

source: Akustikplatten für Decken [Dämmstoffe]
en: Acoustic board for ceilings [insulation]

source: Keramikteile zur Isolierung in Hochspannungsapparaten
en: Ceramic parts for insulation in high-voltage apparatus

source: Kautschukhalbfabrikate in Form von Zuschnitten
en: Semi-finished rubber in the form of cuttings

source: Bremsbeläge [Halbfabrikate]
en: Semi-processed brake linings

source: Schläuche aus flexiblem synthetischem Material
en: Pipes made of synthetic flexible material

source: Kunststoffmaterial in Form von Chips als Polstermaterial für Verpackungen
en: Plastic materials in the form of chips for use as cushioning materials in packaging

source: Garne aus Kohlenstofffasern [ausgenommen für Textilzwecke]
en: Yarns of carbon fibres [other than for use in textiles]

source: Verpackungspolster aus Gummi für Versandbehälter
en: Packing padding of rubber for shipping containers

source: Kunststofffolien zur Verhinderung von Unkrautbildung
en: Plastic sheeting for preventing weed growth

source: Kühlerschläuche, nicht aus Metall
en: Radiator hoses (Non-metallic -)

source: Polyethylenfolien zum Bespannen von Rahmen von landwirtschaftlichen Bauten
en: Polyethylene sheeting for laying over the frames of agricultural structures

source: Polyethylenfolien für Abdeckungen
en: Polyethylene sheeting for use in cloches

source: Polymere Folienmembrane
en: Polymeric membranes

source: Elektrische Isolatoren aus Keramik
en: Electrical ceramic insulators

source: Sequenzierungsmembranen aus Zellulose
en: Sequency membranes of cellulose

source: Formteile aus elektrisch leitendem Kautschuk
en: Shaped parts made from electroconductive rubber

source: Rohrdichtungsmittel zur Abdichtung von Rissen
en: Pipe jointing compounds for sealing cracks

source: Hochspannungsisolatoren [Abstandhalter]
en: Range spacers for high tension insulators

source: Kunststoffe in Form von Platten, Folien, Blöcken, Stäben und Rohren
en: Plastics in the form of sheets, films, blocks, rods and tubes

source: Nicht metallische Wetterschutzdichtungen für Türen
en: Weather seals (Non-metallic -) for doors

source: Gewebe aus Baumwolle für Isolierzwecke
en: Fabrics made from cotton for use as insulation

source: Dichtungsmassen [Mastix]
en: Sealing compounds [mastics]

source: Polyvinylchloridfolie [ausgenommen für Verpackungszwecke]
en: Polyvinyl chloride film [other than for wrapping or packaging]

source: Vorgeformte Isolierbauteile
en: Pre-formed insulation components

source: Druckschläuche, nicht aus Metall
en: Pressure hoses (Non-metallic -)

source: Dichtringe, nicht aus Metall
en: Seals (Non-metallic -) for oil

source: Dichtungen für Luftfederungen, nicht aus Metall
en: Seals (Non-metallic -) for pneumatic suspensions

source: Dichtungen, nicht aus Metall, zur Verwendung in emaillierten Druckbehältern
en: Seals (Non-metallic -) for use in enamelled pressure vessels

source: Gummi zur elektrischen Isolierung
en: Rubber for electrical insulation

source: Gummiummantelungen für Gasleitungen zum Schutz vor Salzwasserkorrosion
en: Rubber sheathing for gas lines for protection against salt water corrosion

source: Glashalteleisten aus Gummi
en: Glass retaining strips of rubber

source: Ungesättigte Polyesterharze [teilweise bearbeitet]
en: Unsaturated polyester resins [semi-finished]

source: Ungesättigte synthetische Polyesterharze [teilweise bearbeitet]
en: Unsaturated synthetic polyester resins [semi-finished]

source: Dichtungen für Wärmetauscher
en: Gaskets for heat exchangers

source: Dichtungsringe als wasserdichte Abdichtungen
en: Gaskets for use as a fluid tight seal

source: Material, nicht aus Metall, zur Schallabsorption [Schallschutz]
en: Structures (non-metallic -) for noise absorption [soundproofing]

source: Synthetisches Gummi in Form von Ballen
en: Synthetic rubber in the form of bales

source: Synthetisches Gummi in Form von Blöcken
en: Synthetic rubber in the form of blocks

source: Synthetisches Gummi in Form von Granulaten
en: Synthetic rubber in the form of granules

source: Synthetischer Kautschuk in Form von Pulvern
en: Synthetic rubber in the form of powders

source: Harze zur Bildung einer gehärteten Schicht an Wänden
en: Resins for use in forming a hardened skin on walls

source: Gummipuffer [Stoßdämpfer]
en: Shock-absorbing buffers of rubber

source: Rohrmuffen, nicht aus Metall
en: Pipe muffs, not of metal

source: Streifen zur Abdichtung gegen Zugluft
en: Draught excluding seals in the form of strips

source: O-Ringe
en: O-rings

source: Ringe zur Abdichtung
en: Rings (Water-tight -)

source: Flexible Leitungen, Röhren, Schläuche und Anschlussstücke, einschließlich Ventile
en: Flexible pipes, tubes, hoses, and fittings therefor, including valves

source: Isolier- Dämm- und Barrierematerialien
en: Insulation and barrier articles and materials

source: Glasfasern und Glaswolle
en: Glass fibre and glass wool

source: Dichtungsfolien und halbverarbeitete synthetische Filtermaterialien
en: Membranes and semi-processed synthetic filtering materials

source: Stoßabsorbierende- und Packungsmaterialien, Schwingungsdämpfer
en: Shock-absorbing and packing materials, vibration dampers

source: Klebebänder, -streifen und -folien
en: Adhesive tapes, strips, bands and films

source: Artikel und Materialien zur Schalldämmung
en: Acoustic insulation articles and materials

source: Feuerresistente und brandvorbeugende Artikel und Materialien
en: Fire resistant and fire preventive articles and materials

source: Artikel und Materialien zur Wärmeisolierung
en: Thermal insulation articles and materials

source: Artikel und Materialien zur Elektroisolierung
en: Electrical insulation articles and materials

source: Artikel und Materialien zur Wasser- und Feuchtigkeitsabdichtung
en: Waterproofing and moisture proofing articles and materials

source: Synthetische- und Verbundwerkstoffe
en: Synthetic and composite materials

source: Formen
en: Molds

source: Fertig- und Halbfabrikate, für einen konkreten Gebrauchszweck angepasst, soweit in dieser Klasse enthalten
en: Finished or semi-finished goods, of materials included in the class, specified for use

source: Statuen und Kunstwerke
en: Statues and works of art

source: Flexible Leitungen, Röhren, Schläuche und Anschlussstücke, einschließlich Ventile, nicht aus Metall
en: Flexible pipes, tubes, hoses, and fittings therefor, including valves, non-metallic

source: Antirutschklebebänder zum Aufbringen auf Fußböden
en: Adhesive anti-slip tape for flooring applications

source: Kunststofffolien für Pack-, Polster- oder Füllzwecke [ausgenommen für Verpackungszwecke]
en: Plastic film for packing, cushioning or stuffing purposes [other than for wrapping]

source: Polymerfolien zur Herstellung von elektronischen Schaltkreisen
en: Polymer film used for manufacturing electronic circuits

source: Naturharze als Halbfabrikate
en: Semi-processed natural resins

source: Harze als Halbfabrikate
en: Semi-processed resins
